{
   "id":"743999723034253",
   "name":"Enterprise Customer Success Manager",
   "uuid":"fee632f5-5996-407e-a979-b8e835acbb97",
   "refNumber":"REF865J",
   "company":{
      "name":"SmartRecruiters Inc",
      "identifier":"smartrecruiters"
   },
   "location":{
      "city":"Berlin",
      "region":"Berlin",
      "country":"de",
      "address":"Wilhelmstraße 118",
      "postalCode":"10963",
      "remote":true
   },
   "industry":{
      "id":"computer_software",
      "label":"Programas informáticos"
   },
   "customField":[
      {
         "fieldId":"58b7e4d6e4b0885c92cd98ee",
         "fieldLabel":"Departmento",
         "valueId":"18605",
         "valueLabel":"Client Success"
      },
      {
         "fieldId":"COUNTRY",
         "fieldLabel":"País",
         "valueId":"de",
         "valueLabel":"Alemanha"
      },
      {
         "fieldId":"58b7e4d6e4b0885c92cd98eb",
         "fieldLabel":"Marcas",
         "valueId":"default",
         "valueLabel":"SmartRecruiters Inc"
      }
   ],
   "releasedDate":"2020-12-02T13:01:09.000Z",
   "creator":{
      "name":"Integrations User",
      "avatarUrl":""
   },
   "postingUrl":"https://jobs.smartrecruiters.com/smartrecruiters/743999726062970-enterprise-customer-success-manager",
   "applyUrl":"https://jobs.smartrecruiters.com/smartrecruiters/743999726062970-enterprise-customer-success-manager?oga=true",
   "referralUrl":"https://jobs.smartrecruiters.com/external-referrals/company/smartrecruiters/publication/fee632f5-5996-407e-a979-b8e835acbb97?dcr_id=DCRA1",
   "jobAd":{
      "sections":{
         "companyDescription":{
            "title":"Company Description",
            "text":"<p>SmartRecruiters understands that people are the heart of an organization. That’s why we’ve built our modern Talent Acquisition Platform to help companies hire the best! We understand that working hard means you should play hard too, that’s why we offer unlimited PTO, competitive salaries, and more. </p>"
         },
         "jobDescription":{
            "title":"Job Description",
            "text":"<p>The Enterprise Customer Success Manager will be an individual contributor on a high performing team that is redefining the client-vendor relationship. We aim to win the hearts and trust of each and every SmartRecruiters user through a truly unique engagement model fundamentally designed to drive Hiring Success.</p><p>As a CSM you will own a portfolio of Enterprise relationships. This includes: supporting customers to achieve Hiring Success, delivering market leading renewal rates, maximizing account growth and enhancing our Enterprise client relationships.</p><p>You will have to demonstrate an ability to successfully own, drive and manage SaaS renewals and expansion opportunities and be able to accurately maintain a rolling 120-day forecast of all your accounts. Likewise, you are responsible for clearly communicating risk and escalating through the appropriate internal channels.   </p><p>Success in the role requires a team player approach, ability to work across different teams with disparate needs, creativity and ability to navigate and build relationships up, down and across highly complex Enterprise organizations. </p>"
         },
         "qualifications":{
            "title":"Qualifications",
            "text":"<ul><li>5+ years experience in a B2B client facing role (professional services, sales, or account management)</li><li>Fluency in both English and German</li><li>Genuine passion for helping clients succeed, and a deep sense of empathy for busy technology users</li><li>Basic understanding of revenue recognition, and knowledge of and restructuring contract terms, and conditions relating to legal, finance and billing</li><li>Great communication skills - able to provide clear &amp; concise guidance through emails, over the phone, or in person</li><li>Able to efficiently switch contexts from responding to customer emails to giving a product demo to meeting with the product team about an upcoming feature</li><li>Relentlessly optimistic</li><li>Innately, understand how to balance advocacy for the company and the client</li><li>Strong writing skills, with a casual and confident tone</li><li>Attentive to the details that make service stand out</li><li>Industry experience preferred but not required</li><li>Up to 15% travel required</li></ul>"
         },
         "additionalInformation":{
            "title":"Additional Information",
            "text":"<p>SmartRecruiters has transformed the hiring process by reducing the stress that comes along with attracting, finding, engaging, and hiring new talent. Leading enterprises like IKEA, Visa, Marc Jacobs, and Square have abandoned their outdated Applicant Tracking Systems (ATS), for our all-in-one platform. What once started as a freemium product, has now turned into the world’s fastest growing enterprise solution.</p><p>We are a fast growing, series D funded start-up on a mission to IPO. If you&apos;re looking to surround yourself with bright and passionate individuals that drive you to be your best - you&apos;ve found the right place! Our transparent and entrepreneurial environment allows you to feel supported, grow your career, and have fun along the way. Everyone is encouraged to be the CEO of their job. This empowers individuals to own their role and have the confidence to explore and implement new ideas. SmartRecruiters believes in promotion from within, so high performance leads to upward mobility.</p><p>SmartRecruiters is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.</p>"
         },
         "videos":{
            "title":"Videos To Watch",
            "urls":[
               "https://www.youtube.com/watch?v=eGb73Obar_c"
            ]
         }
      }
   },
   "function":{
      "id":"sales",
      "label":"Vendas"
   },
   "department":{
      "id":18605,
      "label":"Client Success"
   },
   "experienceLevel":{
      "id":"mid_senior_level",
      "label":"Com experiência"
   },
   "typeOfEmployment":{
      "id":"permanent",
      "label":"Tempo inteiro"
   },
   "language":{
      "code":"en",
      "label":"Inglês",
      "labelNative":"English (US)"
   }
}