{
   "id":"743999723034495",
   "name":"Customer Support Representative (German speaker)",
   "uuid":"2d6884b2-63c3-4d44-9dfe-bed69354864a",
   "refNumber":"REF856V",
   "company":{
      "name":"SmartRecruiters Inc",
      "identifier":"smartrecruiters"
   },
   "location":{
      "city":"Kraków",
      "region":"małopolskie",
      "country":"pl",
      "address":"Fabryczna 20A",
      "postalCode":"31-553",
      "remote":false
   },
   "industry":{
      "id":"internet",
      "label":"Internet"
   },
   "customField":[
      {
         "fieldId":"58b7e4d6e4b0885c92cd98ee",
         "fieldLabel":"Departmento",
         "valueId":"18605",
         "valueLabel":"Client Success"
      },
      {
         "fieldId":"COUNTRY",
         "fieldLabel":"País",
         "valueId":"pl",
         "valueLabel":"Polônia"
      },
      {
         "fieldId":"58b7e4d6e4b0885c92cd98eb",
         "fieldLabel":"Marcas",
         "valueId":"default",
         "valueLabel":"SmartRecruiters Inc"
      },
      {
         "fieldId":"562ff01ce4b06de2b1d46caf",
         "fieldLabel":"Priority",
         "valueId":"6feec94e-a983-4d49-a6b1-c0e4bf045ceb",
         "valueLabel":"P1"
      }
   ],
   "releasedDate":"2020-11-04T13:00:24.000Z",
   "creator":{
      "name":"Integrations User",
      "avatarUrl":""
   },
   "postingUrl":"https://jobs.smartrecruiters.com/smartrecruiters/743999723698586-customer-support-representative-german-speaker-",
   "applyUrl":"https://jobs.smartrecruiters.com/smartrecruiters/743999723698586-customer-support-representative-german-speaker-?oga=true",
   "referralUrl":"https://jobs.smartrecruiters.com/external-referrals/company/smartrecruiters/publication/2d6884b2-63c3-4d44-9dfe-bed69354864a?dcr_id=DCRA1",
   "jobAd":{
      "sections":{
         "companyDescription":{
            "title":"Company Description",
            "text":"<p>At SmartRecruiters, our mission is to connect people with jobs at scale. That’s why we’ve built our modern Talent Acquisition Platform to help companies hire the best talent and to help people find a job they love! </p><p>Our platform is used by hiring teams of Twitter, Visa, Ubisoft, or McDonald’s. We also helped over 50 million candidates through their job search journey.</p><p>We understand that working hard means you should play hard too, that’s why we offer a competitive salary, generous equity, and strong career progression opportunities. We enjoy a collaborative environment that spans offices in San Francisco, Berlin, Krakow, Paris, London, and Spokane. This is a casual and pet-friendly place. Enjoy catered meals, snacks, philanthropic activities, and much more. Needless to say, we make sure you’re taken care of.</p>"
         },
         "jobDescription":{
            "title":"Job Description",
            "text":"<p>We are looking for a Customer Support Star to join an awesome team on its mission to drive success, growth, and excellence for companies who have turned to the new way of hiring. This is an opportunity to join and become an integral part of a high growth software company well on its way of changing an entire industry.</p><p>This person will be instrumental in driving the overall success of SmartRecruiters and ensure more people continue to be wowed and fall in love with SmartRecruiters&apos; hiring success methodology.</p><p><strong>You will:</strong></p><ul><li>Interact every day with SmartRecruiters customers to answer technical questions, resolve issues, educate, and help them succeed.</li><li>Provide awesome customer support for our global clients.</li><li>Educate and advise customers on standards, tips, and solutions on using SmartRecruiters.</li><li>Drive high level of customer satisfaction.</li><li>Identify, test, and call out technical issues.</li><li>Collaborate closely with all parts of the organization, including product management, engineering, and professional services teams to contribute and execute on our strategy to make customers successful.</li><li>Be ready to get involved and lead various projects in the support and services domain.</li><li>Be an ambassador for SmartRecruiters and its culture.</li></ul>"
         },
         "qualifications":{
            "title":"Qualifications",
            "text":"<ul><li>Excellent English and <strong>German </strong>skills are a must</li><li>Experience in <strong>technical customer support </strong>in a SaaS environment.</li><li>Ability to interact and communicate professionally and confidently with a diverse customer base.</li><li>Customer support experience, preferably in the Enterprise space.</li><li>Strong interpersonal, written and spoken communication skills.</li><li>Motivated self-starter capable of taking initiative, handling objections, and negotiating tough situations.</li><li>A passion for technology and a drive to change the world.</li><li>Positive, energetic, with can-do attitude.</li><li>Open to flexible work hours.</li><li>Other languages is a plus.</li></ul>"
         },
         "additionalInformation":{
            "title":"Additional Information",
            "text":"<p>SmartRecruiters has transformed the hiring process by reducing the stress that comes along with attracting, finding, engaging, and hiring new talent. Leading enterprises like IKEA, Visa, Marc Jacobs, and Square have abandoned their outdated Applicant Tracking Systems (ATS), for our all-in-one platform. What once started as a freemium product, has now turned into the world’s fastest growing enterprise solution.</p><p><br />We are a fast growing, series D funded ($50M from Insight) start-up on a mission to IPO. If you&apos;re looking to surround yourself with bright and passionate individuals that drive you to be your best - you&apos;ve found the right place! Our transparent and entrepreneurial environment allows you to feel supported, grow your career, and have fun along the way. Everyone is encouraged to be the CEO of their job. This empowers individuals to own their role and have the confidence to explore and implement new ideas. SmartRecruiters believes in promotion from within, so high performance leads to upward mobility.</p><p><br />SmartRecruiters is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.</p>"
         }
      }
   },
   "function":{
      "id":"customer_service",
      "label":"Serviço de apoio ao cliente"
   },
   "department":{
      "id":18605,
      "label":"Client Success"
   },
   "experienceLevel":{
      "id":"mid_senior_level",
      "label":"Com experiência"
   },
   "typeOfEmployment":{
      "id":"permanent",
      "label":"Tempo inteiro"
   },
   "language":{
      "code":"en",
      "label":"Inglês",
      "labelNative":"English (US)"
   }
}