{
   "id":"743999723034707",
   "name":"Implementation Consultant",
   "uuid":"3ad0e095-2fd3-4bc6-bb18-a098875844d5",
   "refNumber":"REF853Q",
   "company":{
      "name":"SmartRecruiters Inc",
      "identifier":"smartrecruiters"
   },
   "location":{
      "city":"San Francisco",
      "region":"CA",
      "country":"us",
      "address":"225 Bush Street",
      "postalCode":"94104",
      "remote":true
   },
   "industry":{
      "id":"computer_software",
      "label":"Programas informáticos"
   },
   "customField":[
      {
         "fieldId":"58b7e4d6e4b0885c92cd98ee",
         "fieldLabel":"Departmento",
         "valueId":"18605",
         "valueLabel":"Client Success"
      },
      {
         "fieldId":"COUNTRY",
         "fieldLabel":"País",
         "valueId":"us",
         "valueLabel":"Estados Unidos"
      },
      {
         "fieldId":"58b7e4d6e4b0885c92cd98eb",
         "fieldLabel":"Marcas",
         "valueId":"default",
         "valueLabel":"SmartRecruiters Inc"
      },
      {
         "fieldId":"562ff01ce4b06de2b1d46caf",
         "fieldLabel":"Priority",
         "valueId":"6feec94e-a983-4d49-a6b1-c0e4bf045ceb",
         "valueLabel":"P1"
      }
   ],
   "releasedDate":"2020-11-18T13:00:39.000Z",
   "creator":{
      "name":"Integrations User",
      "avatarUrl":""
   },
   "postingUrl":"https://jobs.smartrecruiters.com/smartrecruiters/743999724955177-implementation-consultant",
   "applyUrl":"https://jobs.smartrecruiters.com/smartrecruiters/743999724955177-implementation-consultant?oga=true",
   "referralUrl":"https://jobs.smartrecruiters.com/external-referrals/company/smartrecruiters/publication/3ad0e095-2fd3-4bc6-bb18-a098875844d5?dcr_id=DCRA1",
   "jobAd":{
      "sections":{
         "companyDescription":{
            "title":"Company Description",
            "text":"<p>SmartRecruiters understands that people are the heart of an organization. That’s why we’ve built our modern Talent Acquisition Platform to help companies hire the best!</p><p>As the hiring success company, we enjoy a collaborative office environment that’s business casual and dog-friendly. We understand that working hard means you should play hard too, that’s why we offer unlimited PTO, competitive salaries, generous equity, and health coverage. Enjoy catered meals, unlimited snacks, philanthropic activities, and much more. Needless to say, we make sure you’re taken care of.</p>"
         },
         "jobDescription":{
            "title":"Job Description",
            "text":"<p>As our Implementation Consultant, you will play an important role within our Professional Services team. You will be the main point of contact for our customers who are integrating to SmartRecruiters for the first time. Your passionate, empathetic, can-do attitude will help to successfully onboard, educate and configure our new customer accounts.</p><p><strong>You Will…</strong></p><ul><li>Proactively engage with customers to understand their organization, hiring needs, and challenges</li><li>Possess expert knowledge on best practice usage of SmartRecruiters and understand what drives successful hiring for customers</li><li>Build relationships and serve as a trusted advisor to key customers</li><li>Work cross-functionally with the Customer Success, Sales, and Product teams to ensure a successful implementation, engagement, usage, and customer experience</li><li>Manage relationships with customers to successfully migrate their data to SmartRecruiters while ensuring smooth systems integrations</li></ul>"
         },
         "qualifications":{
            "title":"Qualifications",
            "text":"<ul><li>Experience managing complex implementations and multiple simultaneous projects, including multiple workstreams (i.e. data migration, technical integrations, custom development)</li><li>Comfortable with technology, willingness to learn the details of our product, and understands API functionality</li><li>Track record of managing time appropriately, prioritizing and being very organized</li><li>Energized by working with and advising customers</li><li>Ability to work remotely</li><li>Exposure to the recruiting or recruiting technology industry is a plus</li><li>A passion for technology and disrupting the status quo</li><li>4 year degree (or equivalent specific work experience)</li></ul>"
         },
         "additionalInformation":{
            "title":"Additional Information",
            "text":"<p>SmartRecruiters has transformed the hiring process by reducing the stress that comes along with attracting, finding, engaging, and hiring new talent. Leading enterprises like IKEA, Visa, Marc Jacobs, and Square have abandoned their outdated Applicant Tracking Systems (ATS), for our all-in-one platform. What once started as a freemium product, has now turned into the world’s fastest growing enterprise solution.</p><p>We are a fast growing, series D funded start-up on a mission to IPO. If you&apos;re looking to surround yourself with bright and passionate individuals that drive you to be your best - you&apos;ve found the right place! Our transparent and entrepreneurial environment allows you to feel supported, grow your career, and have fun along the way. Everyone is encouraged to be the CEO of their job. This empowers individuals to own their role and have the confidence to explore and implement new ideas. SmartRecruiters believes in promotion from within, so high performance leads to upward mobility.</p><p>SmartRecruiters is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.</p>"
         },
         "videos":{
            "title":"Videos To Watch",
            "urls":[
               "https://www.youtube.com/watch?v=eGb73Obar_c&t=1s"
            ]
         }
      }
   },
   "function":{
      "id":"project_management",
      "label":"Gestão de projetos"
   },
   "department":{
      "id":18605,
      "label":"Client Success"
   },
   "experienceLevel":{
      "id":"mid_senior_level",
      "label":"Com experiência"
   },
   "typeOfEmployment":{
      "id":"permanent",
      "label":"Tempo inteiro"
   },
   "language":{
      "code":"en",
      "label":"Inglês",
      "labelNative":"English (US)"
   }
}