{
   "id":"743999723034735",
   "name":"Engineering Manager - Candidate Group",
   "uuid":"59752de5-3083-4c17-9148-274154f515b6",
   "refNumber":"REF850W",
   "company":{
      "name":"SmartRecruiters Inc",
      "identifier":"smartrecruiters"
   },
   "location":{
      "city":"Berlin",
      "region":"Berlin",
      "country":"de",
      "address":"Wilhelmstraße 118",
      "postalCode":"10963",
      "remote":false
   },
   "industry":{
      "id":"internet",
      "label":"Internet"
   },
   "customField":[
      {
         "fieldId":"58b7e4d6e4b0885c92cd98ee",
         "fieldLabel":"Departmento",
         "valueId":"18571",
         "valueLabel":"Engineering"
      },
      {
         "fieldId":"COUNTRY",
         "fieldLabel":"País",
         "valueId":"de",
         "valueLabel":"Alemanha"
      },
      {
         "fieldId":"58b7e4d6e4b0885c92cd98eb",
         "fieldLabel":"Marcas",
         "valueId":"default",
         "valueLabel":"SmartRecruiters Inc"
      },
      {
         "fieldId":"562ff01ce4b06de2b1d46caf",
         "fieldLabel":"Priority",
         "valueId":"6feec94e-a983-4d49-a6b1-c0e4bf045ceb",
         "valueLabel":"P1"
      }
   ],
   "releasedDate":"2020-11-25T13:00:33.000Z",
   "creator":{
      "name":"Integrations User",
      "avatarUrl":""
   },
   "postingUrl":"https://jobs.smartrecruiters.com/smartrecruiters/743999725549073-engineering-manager-candidate-group",
   "applyUrl":"https://jobs.smartrecruiters.com/smartrecruiters/743999725549073-engineering-manager-candidate-group?oga=true",
   "referralUrl":"https://jobs.smartrecruiters.com/external-referrals/company/smartrecruiters/publication/59752de5-3083-4c17-9148-274154f515b6?dcr_id=DCRA1",
   "jobAd":{
      "sections":{
         "companyDescription":{
            "title":"Company Description",
            "text":"<p>At SmartRecruiters, our mission is to connect people with jobs at scale. That’s why we’ve built our modern Talent Acquisition Platform to help companies hire the best talent and to help people find a job they love! </p><p>In 10 years, we expanded our customer base to 4000 companies. Our platform is used by hiring teams of Twitter, Visa, Ubisoft, CD Project RED or McDonald’s. We also helped over 50 million candidates through their job search journey.</p><p>We offer a competitive salary, generous equity, and strong career progression opportunities. We enjoy a collaborative environment that spans offices in San Francisco, Berlin, Krakow, Paris, London, and Spokane. This is a casual and pet-friendly place. We pride ourselves on being a product first organization, and we have a spot open on our candidate experience team!</p>"
         },
         "jobDescription":{
            "title":"Job Description",
            "text":"<p>Our product engineering organization is built with small, cross-functional teams where Product Engineers, Product Managers, and Product Designers work side by side on bringing ideas to life. Each of our teams owns a part of our business and take care of it from feature ideas to usage analysis.</p><p>Candidate Group is a set of teams focused on building the next generation of products designed to help 50 million candidates in their search for a dream job. Candidate Group contains four teams at the moment and is expected to grow in the upcoming quarters. </p><p>We are looking for a strong Engineering Manager that will take the lead over the entire group.</p><p><strong>What will you do:</strong></p><ul><li>Collaborate with Lead Product Manager and Lead Designer on building the next generation candidate product.</li><li>Oversee roadmap delivery, which includes: capacity planning, dependency analysis, forecasting, scheduling and metrics collection</li><li>Design experiments and facilitate the culture of continuous improvement. </li><li>Take ownership of quality, performance, and clean architecture of designated services.</li><li>Mentor and help with carer development of Engineering Team Leads and Software Engineers</li><li>Drive great engineering culture in a fast-paced and open environment</li><li>Constantly evolve engineering practices and methodologies.</li><li>Work with Architecture, Infrastructure, and Security teams on building non-functional enhancements.</li><li>Help in implementing prototypes, tools, and key elements of new features.</li></ul>"
         },
         "qualifications":{
            "title":"Qualifications",
            "text":"<ul><li>Excellent communication skills</li><li>Experience in leading engineering teams </li><li>Passion for growing engineers and new engineering leaders</li><li>Experience in building distributed software systems</li><li>Understanding of software craftsmanship principles</li><li>Excellent project management skills</li><li>Deep understanding of agile processes and techniques</li><li>Experience in iterating over consumer-based product would be a plus</li><li>Understanding of Kanban Portfolio Management would be a plus</li></ul>"
         },
         "additionalInformation":{
            "title":"Additional Information",
            "text":"<p>SmartRecruiters has transformed the hiring process by reducing the stress that comes along with attracting, finding, engaging, and hiring new talent. Leading enterprises like IKEA, Visa, Marc Jacobs, and Square have abandoned their outdated Applicant Tracking Systems (ATS), for our all-in-one platform. What once started as a freemium product, has now turned into the world’s fastest growing enterprise solution.</p><p>We are a fast growing, series D funded ($50M from Insight) start-up on a mission to IPO. If you&apos;re looking to surround yourself with bright and passionate individuals that drive you to be your best - you&apos;ve found the right place! Our transparent and entrepreneurial environment allows you to feel supported, grow your career, and have fun along the way. Everyone is encouraged to be the CEO of their job. This empowers individuals to own their role and have the confidence to explore and implement new ideas. SmartRecruiters believes in promotion from within, so high performance leads to upward mobility.</p><p>SmartRecruiters is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.</p>"
         }
      }
   },
   "function":{
      "id":"information_technology",
      "label":"Tecnologias da informação"
   },
   "department":{
      "id":18571,
      "label":"Engineering"
   },
   "experienceLevel":{
      "id":"director",
      "label":"Diretor"
   },
   "typeOfEmployment":{
      "id":"permanent",
      "label":"Tempo inteiro"
   },
   "language":{
      "code":"en",
      "label":"Inglês",
      "labelNative":"English (US)"
   }
}