{
   "id":"743999729219255",
   "name":"Backend Software Engineer (Regular/Senior/Lead)",
   "uuid":"bb49d7f2-8548-44f7-9099-bf47a19d4980",
   "refNumber":"REF781D",
   "company":{
      "name":"SmartRecruiters Inc",
      "identifier":"smartrecruiters"
   },
   "location":{
      "city":"Kraków",
      "region":"małopolskie",
      "country":"pl",
      "address":"Fabryczna 20A",
      "postalCode":"31-553",
      "remote":false
   },
   "industry":{
      "id":"computer_software",
      "label":"Programas informáticos"
   },
   "customField":[
      {
         "fieldId":"58b7e4d6e4b0885c92cd98ee",
         "fieldLabel":"Departmento",
         "valueId":"18571",
         "valueLabel":"Engineering"
      },
      {
         "fieldId":"COUNTRY",
         "fieldLabel":"País",
         "valueId":"pl",
         "valueLabel":"Polônia"
      },
      {
         "fieldId":"58b7e4d6e4b0885c92cd98eb",
         "fieldLabel":"Marcas",
         "valueId":"default",
         "valueLabel":"SmartRecruiters Inc"
      },
      {
         "fieldId":"562ff01ce4b06de2b1d46caf",
         "fieldLabel":"Priority",
         "valueId":"6feec94e-a983-4d49-a6b1-c0e4bf045ceb",
         "valueLabel":"P1"
      }
   ],
   "releasedDate":"2020-12-23T13:00:52.000Z",
   "creator":{
      "name":"Integrations User",
      "avatarUrl":""
   },
   "postingUrl":"https://jobs.smartrecruiters.com/smartrecruiters/743999729219255-backend-software-engineer-regular-senior-lead-",
   "applyUrl":"https://jobs.smartrecruiters.com/smartrecruiters/743999729219255-backend-software-engineer-regular-senior-lead-?oga=true",
   "referralUrl":"https://jobs.smartrecruiters.com/external-referrals/company/smartrecruiters/publication/bb49d7f2-8548-44f7-9099-bf47a19d4980?dcr_id=DCRA1",
   "jobAd":{
      "sections":{
         "companyDescription":{
            "title":"Company Description",
            "text":"<p>At SmartRecruiters, our mission is to connect people with jobs at scale. That’s why we’ve built our modern Talent Acquisition Platform to help companies hire the best talent and to help people find a job they love! </p><p><br />Our platform is used by hiring teams of Twitter, Visa, Ubisoft, or McDonald’s. We also helped over 50 million candidates through their job search journey.</p><p><br />We understand that working hard means you should play hard too, that’s why we offer a competitive salary, generous equity, and strong career progression opportunities. We enjoy a collaborative environment that spans offices in San Francisco, Berlin, Krakow, Paris, London, and Spokane. This is a casual and pet-friendly place. Enjoy catered meals, unlimited snacks, philanthropic activities, and much more. Needless to say, we make sure you’re taken care of.</p>"
         },
         "jobDescription":{
            "title":"Job Description",
            "text":"<p>Have you ever wanted to challenge scaling problems, work with microservices-based architecture and have a real impact on the developed product? If you answer is &quot;yes&quot;, we can offer you these things and much more.</p><p><strong>This offer is for you if:</strong></p><ul><li>You like working in a dynamic, agile environment where you can shape the product.</li><li>You want to experience the culture of a startup with no complex processes and procedures.</li><li>You are a fan of web, technology, and the latest trends.</li><li>You would like to contribute to distributed SaaS system.</li><li>You are the type of a person who wants not only have your ideas heard but see them put into action.</li></ul><p><strong>What you will do:</strong></p><ul><li>Design, develop, test and deploy different components of our system.</li><li>Participate in a full life-cycle of the product.</li><li>Work with passionate people and develop new features.</li><li>Cooperate with our San Francisco based team in different cycles of product development.</li></ul>"
         },
         "qualifications":{
            "title":"Qualifications",
            "text":"<p><strong>Must have:</strong></p><ul><li>Strong commercial experience in Java</li><li>Experience in working with databases, e.g. PostgreSQL, MongoDB, Oracle</li><li>Experience in designing and building RESTful APIs.</li><li>Understanding of test automation techniques.</li><li>Very good level of English (both verbal and written).</li></ul><p><strong>Nice to have:</strong></p><ul><li>Experience in Javascript and Node.js ecosystem</li><li>Familiarity with Amazon AWS</li><li>Familiarity with Docker (and Kubernetes/Mesos Marathon)</li><li>Experience in Python</li><li>Experience in GO</li><li>Experience with full-text search engines (Solr, Elasticsearch).</li><li>Familiarity with Angular framework</li><li>Experience in front-end development</li></ul>"
         },
         "additionalInformation":{
            "title":"Additional Information",
            "text":"<p>SmartRecruiters has transformed the hiring process by reducing the stress that comes along with attracting, finding, engaging, and hiring new talent. Leading enterprises like IKEA, Visa, Marc Jacobs, and Square have abandoned their outdated Applicant Tracking Systems (ATS), for our all-in-one platform. What once started as a freemium product, has now turned into the world’s fastest growing enterprise solution.</p><p><br />We are a fast growing, series D funded ($50M from Insight) start-up on a mission to IPO. If you&apos;re looking to surround yourself with bright and passionate individuals that drive you to be your best - you&apos;ve found the right place! Our transparent and entrepreneurial environment allows you to feel supported, grow your career, and have fun along the way. Everyone is encouraged to be the CEO of their job. This empowers individuals to own their role and have the confidence to explore and implement new ideas. SmartRecruiters believes in promotion from within, so high performance leads to upward mobility.</p><p><br />SmartRecruiters is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.</p>"
         }
      }
   },
   "function":{
      "id":"engineering",
      "label":"Engenharia"
   },
   "department":{
      "id":18571,
      "label":"Engineering"
   },
   "experienceLevel":{
      "id":"mid_senior_level",
      "label":"Com experiência"
   },
   "typeOfEmployment":{
      "id":"permanent",
      "label":"Tempo inteiro"
   },
   "language":{
      "code":"en",
      "label":"Inglês",
      "labelNative":"English (US)"
   }
}