{
   "id":"743999729219120",
   "name":"Digital Marketing Manager - German speaking",
   "uuid":"0ed240ee-0519-4f65-baf1-8d31885ac999",
   "refNumber":"REF867I",
   "company":{
      "name":"SmartRecruiters Inc",
      "identifier":"smartrecruiters"
   },
   "location":{
      "city":"Berlin",
      "region":"Berlin",
      "country":"de",
      "address":"Wilhelmstraße",
      "remote":true
   },
   "industry":{
      "id":"computer_software",
      "label":"Programas informáticos"
   },
   "customField":[
      {
         "fieldId":"58b7e4d6e4b0885c92cd98ee",
         "fieldLabel":"Departmento",
         "valueId":"18554",
         "valueLabel":"Marketing"
      },
      {
         "fieldId":"COUNTRY",
         "fieldLabel":"País",
         "valueId":"de",
         "valueLabel":"Alemanha"
      },
      {
         "fieldId":"58b7e4d6e4b0885c92cd98eb",
         "fieldLabel":"Marcas",
         "valueId":"default",
         "valueLabel":"SmartRecruiters Inc"
      },
      {
         "fieldId":"562ff01ce4b06de2b1d46caf",
         "fieldLabel":"Priority",
         "valueId":"6feec94e-a983-4d49-a6b1-c0e4bf045ceb",
         "valueLabel":"P1"
      }
   ],
   "releasedDate":"2020-12-23T13:00:44.000Z",
   "creator":{
      "name":"Integrations User",
      "avatarUrl":""
   },
   "postingUrl":"https://jobs.smartrecruiters.com/smartrecruiters/743999729219120-digital-marketing-manager-german-speaking",
   "applyUrl":"https://jobs.smartrecruiters.com/smartrecruiters/743999729219120-digital-marketing-manager-german-speaking?oga=true",
   "referralUrl":"https://jobs.smartrecruiters.com/external-referrals/company/smartrecruiters/publication/0ed240ee-0519-4f65-baf1-8d31885ac999?dcr_id=DCRA1",
   "jobAd":{
      "sections":{
         "companyDescription":{
            "title":"Company Description",
            "text":"<p>SmartRecruiters understands that people are the heart of an organization. That’s why we’ve built our modern Talent Acquisition Platform to help companies hire the best! As the hiring success company, we enjoy a collaborative office environment that’s business casual and dog-friendly. Needless to say, we make sure you’re taken care of.</p>"
         },
         "jobDescription":{
            "title":"Job Description",
            "text":"<p>As a member of our EMEA Marketing team, you’ll be driving pipeline growth through creative, targeted marketing campaigns and managing our digital strategy and execution for the EMEA region.</p><p> </p><p>You will be part of a lean team in the region, where each individual is working closely together to support each other in the delivery of a best of class go to market strategy. You will be reporting to the EMEA Marketing Manager.</p><p> </p><p>The perfect hire is a data-driven marketer with creative thinking who will:</p><ul><li><p>Create and implement measurable digital marketing programs that generate new leads, nurture our database and drive demand for our product for the EMEA region.</p></li><li><p>Work closely with our RVP and Sales team in the DACH region to build and own the marketing calendar for our top + middle of funnel programs, taking into account industry trends and audience interest</p></li><li><p>Curate and re-use existing content as well as map out content needs for new programs and decide on localisation needs from our Global content calendar. </p></li><li><p>Support our customer marketing plan in the DACH region, including meet-up, case study and press releases.</p></li><li><p>Collaborate with partners, influencers and external vendors to drive lead generation and fill the top of the funnel in the DACH region</p></li><li><p>Partner closely with product marketing, marketing ops and sales development teams to ensure proper messaging, timing and execution of one-off and ongoing campaigns across email, web personalization and advertising</p></li><li><p>Manage our localized websites across the region (.co.uk / .fr / .de)</p></li><li><p>Measure, analyze, and report on campaign performance, iterating and optimizing on an ongoing basis</p></li></ul><p> </p><p><strong>Expectations</strong></p><ul><li><p>3 months: Build relationships with all key stakeholders, ramp on persona + industry knowledge, and gain deep understanding of current MarTech stack. Conduct in-depth analysis of current Digital Strategy for EMEA and the Demand Generation strategy for the DACH region and map out adjustments for 2021.</p></li><li><p>12 months: Deliver Phase I of an end-to-end Digital Strategy in the EMEA region and a Demand Marketing program that generates high quality leads, delivers continuous engagement within our target accounts and optimizes lead management throughout the marketing funnel.</p></li></ul>"
         },
         "qualifications":{
            "title":"Qualifications",
            "text":"<ul><li><p>Speak German and English fluently</p></li><li><p>Plan and execute all digital marketing, including SEO/SEM, marketing database, email,  and display advertising campaigns</p></li><li><p>Measure and report performance of all digital marketing campaigns, and assess against goals (ROI and KPIs)</p></li><li><p>Plan, execute, and measure experiments and conversion tests</p></li><li><p>Utilize strong analytical ability to evaluate end-to-end customer experience across multiple channels and customer touch points</p></li><li><p>Instrument conversion points and optimize user funnels</p></li><li><p>Relevant experience using marketing automation technology (ideally Marketo) and Salesforce</p></li><li><p>Experience in creating and executing B2B Demand Generation Programs using a mix of inbound and outbound channels</p></li><li><p>Hands-on attitude and excellent project management skills</p></li><li><p>Strong communication skills and track record of collaborating effectively with Marketing and Sales stakeholders</p></li></ul><p> </p><p>Nice-to-have</p><ul><li><p>Startup experience, ideally in a growth marketing/demand generation role</p></li><li><p>Experience in the HR or recruiting technology space</p></li></ul>"
         },
         "additionalInformation":{
            "title":"Additional Information",
            "text":""
         }
      }
   },
   "function":{
      "id":"marketing",
      "label":"Marketing"
   },
   "department":{
      "id":18554,
      "label":"Marketing"
   },
   "experienceLevel":{
      "id":"associate",
      "label":"Especialista"
   },
   "typeOfEmployment":{
      "id":"permanent",
      "label":"Tempo inteiro"
   },
   "language":{
      "code":"en",
      "label":"Inglês",
      "labelNative":"English (US)"
   }
}