{
   "id":"743999729219177",
   "name":"Product Manager",
   "uuid":"57d2ba7f-5937-475b-858d-173d43b3af54",
   "refNumber":"REF837A",
   "company":{
      "name":"SmartRecruiters Inc",
      "identifier":"smartrecruiters"
   },
   "location":{
      "city":"Philadelphia",
      "region":"PA",
      "country":"us",
      "address":"1200 Chestnut Street",
      "postalCode":"19107",
      "remote":true
   },
   "industry":{
      "id":"computer_software",
      "label":"Programas informáticos"
   },
   "customField":[
      {
         "fieldId":"58b7e4d6e4b0885c92cd98ee",
         "fieldLabel":"Departmento",
         "valueId":"18588",
         "valueLabel":"Product"
      },
      {
         "fieldId":"COUNTRY",
         "fieldLabel":"País",
         "valueId":"us",
         "valueLabel":"Estados Unidos"
      },
      {
         "fieldId":"58b7e4d6e4b0885c92cd98eb",
         "fieldLabel":"Marcas",
         "valueId":"default",
         "valueLabel":"SmartRecruiters Inc"
      },
      {
         "fieldId":"562ff01ce4b06de2b1d46caf",
         "fieldLabel":"Priority",
         "valueId":"50368069-c1aa-45c4-8cb7-4eb2da296a53",
         "valueLabel":"P2"
      }
   ],
   "releasedDate":"2020-12-23T13:00:48.000Z",
   "creator":{
      "name":"Integrations User",
      "avatarUrl":""
   },
   "postingUrl":"https://jobs.smartrecruiters.com/smartrecruiters/743999729219177-product-manager",
   "applyUrl":"https://jobs.smartrecruiters.com/smartrecruiters/743999729219177-product-manager?oga=true",
   "referralUrl":"https://jobs.smartrecruiters.com/external-referrals/company/smartrecruiters/publication/57d2ba7f-5937-475b-858d-173d43b3af54?dcr_id=DCRA1",
   "jobAd":{
      "sections":{
         "companyDescription":{
            "title":"Company Description",
            "text":"<p>At SmartRecruiters, our mission is to connect people with jobs at scale. That’s why we’ve built our modern Talent Acquisition Platform to help companies hire the best talent and to help people find a job they love! </p><p>Our platform is used by hiring teams of Twitter, Visa, Ubisoft, or McDonald’s. We also helped over 50 million candidates through their job search journey.</p><p>We understand that working hard means you should play hard too, that’s why we offer a competitive salary, generous equity, and strong career progression opportunities. We enjoy a collaborative environment that spans offices in San Francisco, Berlin, Krakow, Paris, London, and Spokane. This is a casual and pet-friendly place. Enjoy catered meals, unlimited snacks, philanthropic activities, and much more. Needless to say, we make sure you’re taken care of.</p>"
         },
         "jobDescription":{
            "title":"Job Description",
            "text":"<p>We are now looking for an outstanding Product Manager to help us build and grow our amazing product! In this role, you will own the product roadmap from conception to implementation and beyond. We believe in continuous improvement of features we have shipped, as well as rigorous measurement of their impact on our users.</p><p>Your ability to research, be creative, display grit, lead, and listen will determine the future of the product. This is an interdisciplinary role, and you will work with Design, Engineering, Data Science, and Product Marketing to deliver a world-class product. You will launch new products that support our mission of connecting people to jobs at scale.</p><p>This is an exceptional opportunity to build innovative products at a global startup with plenty of market traction and customer love. Your product will be used at scale: recruiting teams at thousands of companies worldwide and millions of candidates will benefit from your work. If you enjoy tackling both strategy and day-to-day execution, and are ready to roll up your sleeves on day one, come work with us.</p><p>You’ll join a supportive, diverse group of talented Product Managers, Designers and Engineers in Berlin, San Francisco and Krakow. We are looking for someone who will love recruiting technology innovation as much as we do!</p>"
         },
         "qualifications":{
            "title":"Qualifications",
            "text":"<ul><li>Ability to make things happen</li><li>Ability to turn complexity and uncertainty into awesomeness</li><li>Self-starter with with an appetite and ability to own a large part of the product</li><li>Experience designing products that optimize web and mobile visit conversion</li><li>Product management experience at a SaaS or B2C start-up</li><li>Experience working with job boards (both mainstream &amp; niche)</li><li>Familiarity with AI, data science and data engineering</li><li>Good understanding of how software products leverage machine learning algorithms</li><li>Good grasp of UX</li><li>Keen interest in technological innovation</li><li>Empathy and active listening</li><li>Penchant for data-informed decision-making</li><li>Excellent communication skills</li><li>Ability to collaborate and lead across multiple teams on complex projects</li><li>Attention to detail</li><li>Aspiration to be an excellent colleague and teammate</li><li>Fluent in English</li></ul>"
         },
         "additionalInformation":{
            "title":"Additional Information",
            "text":"<p>SmartRecruiters has transformed the hiring process by reducing the stress that comes along with attracting, finding, engaging, and hiring new talent. Leading enterprises like IKEA, Visa, Marc Jacobs, and Square have abandoned their outdated Applicant Tracking Systems (ATS), for our all-in-one platform. What once started as a freemium product, has now turned into the world’s fastest growing enterprise solution.</p><p>We are a fast growing, series D funded start-up on a mission to IPO. If you&apos;re looking to surround yourself with bright and passionate individuals that drive you to be your best - you&apos;ve found the right place! Our transparent and entrepreneurial environment allows you to feel supported, grow your career, and have fun along the way. Everyone is encouraged to be the CEO of their job. This empowers individuals to own their role and have the confidence to explore and implement new ideas. SmartRecruiters believes in promotion from within, so high performance leads to upward mobility.</p><p>SmartRecruiters is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.</p>"
         }
      }
   },
   "function":{
      "id":"information_technology",
      "label":"Tecnologias da informação"
   },
   "department":{
      "id":18588,
      "label":"Product"
   },
   "experienceLevel":{
      "id":"mid_senior_level",
      "label":"Com experiência"
   },
   "typeOfEmployment":{
      "id":"permanent",
      "label":"Tempo inteiro"
   },
   "language":{
      "code":"en",
      "label":"Inglês",
      "labelNative":"English (US)"
   }
}