{
   "id":"743999724312284",
   "name":"Sales Development Representative",
   "uuid":"4bb6c937-4ead-4a01-8bf7-a5172b621fbf",
   "refNumber":"REF587W",
   "company":{
      "name":"SmartRecruiters Inc",
      "identifier":"smartrecruiters"
   },
   "location":{
      "city":"Raleigh",
      "region":"NC",
      "country":"us",
      "address":"510 West Martin Street",
      "postalCode":"27603",
      "remote":true
   },
   "industry":{
      "id":"computer_software",
      "label":"Programas informáticos"
   },
   "customField":[
      {
         "fieldId":"58b7e4d6e4b0885c92cd98ee",
         "fieldLabel":"Departmento",
         "valueId":"54016",
         "valueLabel":"Sales"
      },
      {
         "fieldId":"COUNTRY",
         "fieldLabel":"País",
         "valueId":"us",
         "valueLabel":"Estados Unidos"
      },
      {
         "fieldId":"58b7e4d6e4b0885c92cd98eb",
         "fieldLabel":"Marcas",
         "valueId":"default",
         "valueLabel":"SmartRecruiters Inc"
      },
      {
         "fieldId":"562ff01ce4b06de2b1d46caf",
         "fieldLabel":"Priority",
         "valueId":"6feec94e-a983-4d49-a6b1-c0e4bf045ceb",
         "valueLabel":"P1"
      }
   ],
   "releasedDate":"2020-11-11T04:06:48.000Z",
   "creator":{
      "name":"Maggie Hennessey",
      "avatarUrl":"https://c.smartrecruiters.com/sr-employee-image-prod/5bfc94ce52faff0006bac1f5?r=s3&_1607451821976"
   },
   "postingUrl":"https://jobs.smartrecruiters.com/smartrecruiters/743999724312284-sales-development-representative",
   "applyUrl":"https://jobs.smartrecruiters.com/smartrecruiters/743999724312284-sales-development-representative?oga=true",
   "referralUrl":"https://jobs.smartrecruiters.com/external-referrals/company/smartrecruiters/publication/4bb6c937-4ead-4a01-8bf7-a5172b621fbf?dcr_id=DCRA1",
   "jobAd":{
      "sections":{
         "companyDescription":{
            "title":"Company Description",
            "text":"<p>SmartRecruiters is a fast-growing San Francisco software startup with offices all around the world. SmartRecruiters is a tool that recruiters use to find and hire great talent- some of the world&apos;s largest and most famous brands use SmartRecruiters!</p><p>We are bright, passionate individuals on a mission to change the way companies hire. We live and breath our value of AS ONE through our collaborative and supportive culture. Everyone is encouraged to be the CEO of their job. SmartRecruiters believes in promotion from within, so high performance can lead to upward mobility. </p><p>Our inclusive office environment welcomes and respects all.</p>"
         },
         "jobDescription":{
            "title":"Job Description",
            "text":"<p>Fun team, amazing office, and uncapped commission with generous accelerators are just the beginning. As a Sales Development Representative (SDR) at SmartRecruiters, you have the unique opportunity to build a foundation for an exciting and rewarding career in tech sales.</p><p>As a key member of our sales team, you will...</p><ul><li>Participate in an amazing sales training program, where you will learn the history of the industry, our target buyer, best practices for qualifying prospective clients, and more</li><li>Receive continued coaching and support as you work towards promotion and professional growth</li><li>Qualify and nurture sales leads, including some of the world’s largest and most successful companies</li><li>Use your creativity and detective skills to connect with decision makers to schedule meetings for Account Executives</li><li>Professionally represent the SmartRecruiters brand, vision, and values</li><li>Surround yourself with ambitious professionals who create a fun and exciting work environment</li></ul>"
         },
         "qualifications":{
            "title":"Qualifications",
            "text":"<ul><li>Ability to think on your feet and overcome objections/rejections</li><li>Comfortable spending most of your workday sending out emails and making cold calls to Managers, Directors, VPs and C-level Executives</li><li>Strong interpersonal, written, and spoken communication skills</li><li>Self-disciplined with the ability to prioritize, manage time effectively, and know when to ask for help</li><li>Coachable with a genuine curiosity to learn and grow</li></ul>"
         },
         "additionalInformation":{
            "title":"Additional Information",
            "text":"<p>We are a fast growing, series D funded ($50M from Insight) start-up on a mission to IPO. If you&apos;re looking to surround yourself with bright and passionate individuals that drive you to be your best - you&apos;ve found the right place! Our transparent and entrepreneurial environment allows you to feel supported, grow your career, and have fun along the way. Everyone is encouraged to be the CEO of their job. This empowers individuals to own their role and have the confidence to explore and implement new ideas. SmartRecruiters believes in promotion from within, so high performance leads to upward mobility.</p><p>SmartRecruiters is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.</p>"
         },
         "videos":{
            "title":"Videos To Watch",
            "urls":[
               "https://www.youtube.com/watch?v=eGb73Obar_c"
            ]
         }
      }
   },
   "function":{
      "id":"sales",
      "label":"Vendas"
   },
   "department":{
      "id":54016,
      "label":"Sales"
   },
   "experienceLevel":{
      "id":"entry_level",
      "label":"Sem experiência"
   },
   "typeOfEmployment":{
      "id":"permanent",
      "label":"Tempo inteiro"
   },
   "language":{
      "code":"en",
      "label":"Inglês",
      "labelNative":"English (US)"
   }
}