{
   "id":"743999723228373",
   "name":"Marketing Operations Manager",
   "uuid":"61c5b69d-62d7-4fc5-a2be-d48cb441005a",
   "refNumber":"REF862S",
   "company":{
      "name":"SmartRecruiters Inc",
      "identifier":"smartrecruiters"
   },
   "location":{
      "city":"San Francisco",
      "region":"CA",
      "country":"us",
      "address":"225 Bush Street",
      "postalCode":"94104",
      "remote":true
   },
   "industry":{
      "id":"computer_software",
      "label":"Programas informáticos"
   },
   "customField":[
      {
         "fieldId":"58b7e4d6e4b0885c92cd98ee",
         "fieldLabel":"Departmento",
         "valueId":"18554",
         "valueLabel":"Marketing"
      },
      {
         "fieldId":"COUNTRY",
         "fieldLabel":"País",
         "valueId":"us",
         "valueLabel":"Estados Unidos"
      },
      {
         "fieldId":"58b7e4d6e4b0885c92cd98eb",
         "fieldLabel":"Marcas",
         "valueId":"default",
         "valueLabel":"SmartRecruiters Inc"
      },
      {
         "fieldId":"562ff01ce4b06de2b1d46caf",
         "fieldLabel":"Priority",
         "valueId":"50368069-c1aa-45c4-8cb7-4eb2da296a53",
         "valueLabel":"P2"
      }
   ],
   "releasedDate":"2020-10-29T23:19:22.000Z",
   "creator":{
      "name":"Maggie Hennessey",
      "avatarUrl":"https://c.smartrecruiters.com/sr-employee-image-prod/5bfc94ce52faff0006bac1f5?r=s3&_1607451821976"
   },
   "postingUrl":"https://jobs.smartrecruiters.com/smartrecruiters/743999723228373-marketing-operations-manager",
   "applyUrl":"https://jobs.smartrecruiters.com/smartrecruiters/743999723228373-marketing-operations-manager?oga=true",
   "referralUrl":"https://jobs.smartrecruiters.com/external-referrals/company/smartrecruiters/publication/61c5b69d-62d7-4fc5-a2be-d48cb441005a?dcr_id=DCRA1",
   "jobAd":{
      "sections":{
         "companyDescription":{
            "title":"Company Description",
            "text":"<p>SmartRecruiters understands that people are the heart of an organization. That’s why we’ve built our modern Talent Acquisition Platform to help companies hire the best! As the hiring success company, we enjoy a collaborative office environment that’s business casual and dog-friendly. We understand that working hard means you should play hard too, that’s why we offer unlimited PTO, competitive salaries, generous equity, and health coverage. Enjoy catered meals, unlimited snacks, philanthropic activities, and much more. Needless to say, we make sure you’re taken care of. </p>"
         },
         "jobDescription":{
            "title":"Job Description",
            "text":"<p>The role of the Marketing Operations Manager is to focus on the strategy, design, execution and operations of the business’s lead management processes, marketing databases, marketing automation solutions, and tracking performance in order to plan, report, and conduct analyses. The Marketing Operations Manager is agile and has a passion for data, metrics, and reporting.</p><p>The Marketing Operations Manager also excels in operations that facilitate scalability, predictability, and efficiency of marketing operations. This is an engaging and hands-on role and the Marketing Operations Manager, therefore, is an individual who is highly capable of operating and excelling at the strategic and tactical positions.</p><p><strong>Experience: </strong></p><p>A candidate for this position will have had at least 4 years working experience in a marketing capacity playing offline, digital, and analytical marketing roles. The candidate will demonstrate proficiency in the use of Marketing Automation Tools such as Marketo, Outreach, LeanData, Engagio, LeadIQ, ZoomInfo, etc. They will also have experience working with website supporting tools, for example, Analytics, SEO tools, and Content Management Systems.</p><p>A suitable candidate will demonstrate a deep interest in conducting quantitative analyses and forecasting program results. The candidate will also have proven and successful experience and expertise in CRM solutions and marketing automation. The Marketing Operations Manager will similarly have expertise in lead scoring, ROI, leading volume trends, forecasting, and SaaS experience.</p><p><br /><strong>Analytical Skills: </strong></p><p>The Marketing Operations Manager must portray a high comfort level and thrive working with marketing automation tools. They must be a results-driven individual with a strong ability to conduct quantitative data analyses in order to determine ROI, forecasting, program effectiveness, and lead volume trends. A candidate for the position, therefore, has to be a metrics-focused marketer who has a deep interest and love for analyzing and understanding data in order to inform marketing decisions.</p><p> </p><p><strong>Responsibilities:</strong></p><ul><li>Manage technical aspects of key marketing systems (marketing automation, CRM, lead routing / scoring, intent data) used to generate, distribute, and report on leads.</li><li>Establish and maintain scalable processes that ensure best practices in campaign and lead management.</li><li>Create and maintain metrics reports on marketing and sales activities, effectiveness, and business impact.</li><li>Analyze marketing and sales data to develop insights and make recommendations on areas for optimization.</li><li>Monitor and maintain data quality within the marketing  / CRM database.</li><li>Evaluate new technologies and add-on applications to improve and optimize marketing team performance.</li></ul>"
         },
         "qualifications":{
            "title":"Qualifications",
            "text":"<ul><li>BA/BS or equivalent working experience.</li><li>Strong analytical skills (including mastery of Microsoft Excel) and experience with reporting and data analysis.</li><li>Proficiency in marketing automation systems ( Marketo / Pardot) and integrating those systems with other technologies, Salesforce, Outreach, LeanData, ZoomInfo, Engagio, etc.</li><li>Ability to manage multiple projects at the same time in a fast-paced environment.</li><li>Technically capable, excellent communicator, and a desire to create and improve processes that scale and challenge the status quo.</li></ul>"
         },
         "additionalInformation":{
            "title":"Additional Information",
            "text":"<p>SmartRecruiters has transformed the hiring process by reducing the stress that comes along with attracting, finding, engaging, and hiring new talent. Leading enterprises like IKEA, Visa, Marc Jacobs, and Square have abandoned their outdated Applicant Tracking Systems (ATS), for our all-in-one platform. What once started as a freemium product, has now turned into the world’s fastest growing enterprise solution.</p><p>We are a fast growing, series D funded start-up on a mission to IPO. If you&apos;re looking to surround yourself with bright and passionate individuals that drive you to be your best - you&apos;ve found the right place! Our transparent and entrepreneurial environment allows you to feel supported, grow your career, and have fun along the way. Everyone is encouraged to be the CEO of their job. This empowers individuals to own their role and have the confidence to explore and implement new ideas. SmartRecruiters believes in promotion from within, so high performance leads to upward mobility.</p><p>SmartRecruiters is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.</p>"
         }
      }
   },
   "function":{
      "id":"marketing",
      "label":"Marketing"
   },
   "department":{
      "id":18554,
      "label":"Marketing"
   },
   "experienceLevel":{
      "id":"mid_senior_level",
      "label":"Com experiência"
   },
   "typeOfEmployment":{
      "id":"permanent",
      "label":"Tempo inteiro"
   },
   "language":{
      "code":"en",
      "label":"Inglês",
      "labelNative":"English (US)"
   }
}