{
   "id":"743999723034827",
   "name":"Data Protection Officer",
   "uuid":"bed4e18c-658c-4ab5-92dc-40f6546cca0e",
   "refNumber":"REF848D",
   "company":{
      "name":"SmartRecruiters Inc",
      "identifier":"smartrecruiters"
   },
   "location":{
      "city":"Berlin",
      "region":"Berlin",
      "country":"de",
      "address":"Wilhelmstraße",
      "remote":true
   },
   "industry":{
      "id":"computer_software",
      "label":"Programas informáticos"
   },
   "customField":[
      {
         "fieldId":"58b7e4d6e4b0885c92cd98ee",
         "fieldLabel":"Departmento",
         "valueId":"354474",
         "valueLabel":"Finance & Admin"
      },
      {
         "fieldId":"COUNTRY",
         "fieldLabel":"País",
         "valueId":"de",
         "valueLabel":"Alemanha"
      },
      {
         "fieldId":"58b7e4d6e4b0885c92cd98eb",
         "fieldLabel":"Marcas",
         "valueId":"default",
         "valueLabel":"SmartRecruiters Inc"
      },
      {
         "fieldId":"562ff01ce4b06de2b1d46caf",
         "fieldLabel":"Priority",
         "valueId":"6feec94e-a983-4d49-a6b1-c0e4bf045ceb",
         "valueLabel":"P1"
      }
   ],
   "releasedDate":"2020-11-04T13:00:39.000Z",
   "creator":{
      "name":"Integrations User",
      "avatarUrl":""
   },
   "postingUrl":"https://jobs.smartrecruiters.com/smartrecruiters/743999723698845-data-protection-officer",
   "applyUrl":"https://jobs.smartrecruiters.com/smartrecruiters/743999723698845-data-protection-officer?oga=true",
   "referralUrl":"https://jobs.smartrecruiters.com/external-referrals/company/smartrecruiters/publication/bed4e18c-658c-4ab5-92dc-40f6546cca0e?dcr_id=DCRA1",
   "jobAd":{
      "sections":{
         "companyDescription":{
            "title":"Company Description",
            "text":"<p>At SmartRecruiters, our mission is to connect people with jobs at scale. That’s why we’ve built our modern Talent Acquisition Platform to help companies hire the best talent and to help people find a job they love! </p><p><br />Our platform is used by hiring teams of Twitter, Visa, Ubisoft, or McDonald’s. We also helped over 50 million candidates through their job search journey.</p><p><br />We understand that working hard means you should play hard too, that’s why we offer a competitive salary, generous equity, and strong career progression opportunities. We enjoy a collaborative environment that spans offices in San Francisco, Berlin, Krakow, Paris, London, and Spokane. This is a casual and pet-friendly place. Enjoy catered meals, unlimited snacks, philanthropic activities, and much more. Needless to say, we make sure you’re taken care of.</p>"
         },
         "jobDescription":{
            "title":"Job Description",
            "text":"<p>This opportunity allows you to work with our largest enterprise customers, candidates, data privacy institutions and internal teams. You will be responsible for the following activities:</p><ul><li>Make Data Privacy a competitive advantage by engaging prospects, customers and supporting sales teams with excellent messaging and documentation</li><li>Partner with product and legal teams to maintain compliant solution while minimising user impact</li><li>Provide privacy trainings and ensure that adequate awareness is provided </li><li>Set up proper ticketing and escalation processes to manage all privacy requests and response to escalation / crisis</li><li>Conduct data protection audits and DPIAs, provide risk assessments and monitor their performance </li><li>Be an amazing Smartian that exemplifies our values and everybody loves working with</li></ul>"
         },
         "qualifications":{
            "title":"Qualifications",
            "text":"<p>We expect the competencies in the following areas:</p><p><u>Legal:</u></p><ul><li>Expertise in national and European data protection laws and practices, and an in-depth understanding of the GDPR. </li><li>Good understanding of Data Privacy legislation in other required countries outside of EU (Canada, China, Russia, Australia, etc)</li><li>CIPP/CIPM/CIPT or similar certificates are required</li></ul><p><u>Product:</u></p><ul><li>Strong analytical skills</li><li>Good knowledge of HR/Recruitment industry</li></ul><p><u>Technology:</u></p><ul><li>​​​​​​​Good understanding of SDLC (Software Development Lifecycle)</li><li>Good understanding of Cloud services</li><li>Good understanding of data security </li></ul><p><u>Other skills:</u></p><ul><li>​​​​​​​Speaks fluent English</li><li>Nice to have: German language</li><li>Leadership, decision making and project management experience; </li><li>Communication &amp; Marketing skills</li><li>Negotiation skills</li><li>Incident management skills</li><li>Nice to have: Auditor experience</li></ul>"
         },
         "additionalInformation":{
            "title":"Additional Information",
            "text":"<p>SmartRecruiters has transformed the hiring process by reducing the stress that comes along with attracting, finding, engaging, and hiring new talent. Leading enterprises like IKEA, Visa, Marc Jacobs, and Square have abandoned their outdated Applicant Tracking Systems (ATS), for our all-in-one platform. What once started as a freemium product, has now turned into the world’s fastest growing enterprise solution.</p><p><br />We are a fast growing, series D funded ($50M from Insight) start-up on a mission to IPO. If you&apos;re looking to surround yourself with bright and passionate individuals that drive you to be your best - you&apos;ve found the right place! Our transparent and entrepreneurial environment allows you to feel supported, grow your career, and have fun along the way. Everyone is encouraged to be the CEO of their job. This empowers individuals to own their role and have the confidence to explore and implement new ideas. SmartRecruiters believes in promotion from within, so high performance leads to upward mobility.</p><p><br />SmartRecruiters is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.</p>"
         }
      }
   },
   "function":{
      "id":"information_technology",
      "label":"Tecnologias da informação"
   },
   "department":{
      "id":354474,
      "label":"Finance & Admin"
   },
   "experienceLevel":{
      "id":"mid_senior_level",
      "label":"Com experiência"
   },
   "typeOfEmployment":{
      "id":"permanent",
      "label":"Tempo inteiro"
   },
   "language":{
      "code":"en",
      "label":"Inglês",
      "labelNative":"English (US)"
   }
}